app/controllers/consultas_controller.rb

SELECT * FROM "consultas" WHERE (data_hora = '2010-11-17 09:30:00.000000' ) AND ("consultas".local_id = 674971705)
UPDATE "consultas" SET "updated_at" = '2011-08-22 02:23:55.509500', "efetuado" = NULL WHERE "id" = 882099334
---
  def update_column
    if params[:column] == 'efetuado'
      Consulta.find(params[:id]).update_attribute(:efetuado, params[:value])