app/controllers/consultas_controller.rb

  def gravar_efetuado
    consulta = Consulta.find(params[:consulta_id])
    consulta.efetuado = params[:efetuado]
    consulta.save
---
SELECT * FROM "consultas" WHERE (data_hora = '2010-11-17 09:30:00.000000' ) AND ("consultas".local_id = 674971705)
UPDATE "consultas" SET "updated_at" = '2011-08-02 01:26:06.704870', "efetuado" = 'f' WHERE "id" = 882099334